# Author: Andrii Reva, sKS-18
# Date: 08.03.2020


def task9():
    main_list = [["Ватутіне", "Черкаська обл.", 16665, 10.89], ["Золотоноша", "Черкаська обл.", 28259, 21.65],
                 ["Кам'янка", "Черкаська обл.", 11857, 15.23], ["Канів", "Черкаська обл.", 23884, 17.42],
                 ["Корсунь-Шевченківський", "Черкаська обл.", 19328, 118.65], ["Сміла", "Черкаська обл.", 68805, 39.85],
                 ["Умань", "Черкаська обл.", 83977, 41], ["Черкаси", "Черкаська обл.", 277944, 69],
                 ["Чигирин", "Черкаська обл.", 8995, 10.7], ["Біла Церква", "Київська обл.", 209176, 67.8],
                 ["Бориспіль", "Київська обл.", 61613, 37.01], ["Бровари", "Київська обл.", 106185, 34],
                 ["Вишгород", "Київська обл.", 27825, 8.7], ["Київ", "Київська обл.", 2949558, 847.66],
                 ["Переяслав-Хмельницький", "Київська обл.", 27548, 32]]
    collection = dict()
    another_list = []
    for city in main_list:
        key = str(city[1])
        if city[2] % 2 == 0:
            collection[key] = 1
            if city[1] in collection:
                count = collection.get(key)
                count += 1
                collection[key] = count
            else:
                collection[key] = 1
        else:
            another_list.append(city)
    for key, value in collection.items():
        print(key, "-", value)
    print("Another:")
    for city in another_list:
        print(city)


task9()
